artillery.yml
config:
  target: 'https://api.kv.vberkoz.com'
  phases:
    - duration: 30
      arrivalRate: 5
      name: 'Warm up'
    - duration: 60
      arrivalRate: 20
      name: 'Ramp up'
    - duration: 120
      arrivalRate: 50
      name: 'Sustained load'
    - duration: 60
      arrivalRate: 100
      name: 'Peak load'
    - duration: 30
      arrivalRate: 10
      name: 'Cool down'
  defaults:
    headers:
      x-api-key: '{{ $env.API_KEY }}'
      Content-Type: 'application/json'
  plugins:
    expect: {}
  processor: './artillery-processor.js'

scenarios:
  - name: 'Write-heavy workload'
    weight: 40
    flow:
      - put:
          url: '/v1/loadtest/user:{{ $randomNumber(1, 10000) }}'
          json:
            value:
              id: '{{ $randomNumber() }}'
              name: 'User {{ $randomString() }}'
              email: 'user{{ $randomNumber() }}@example.com'
              timestamp: '{{ $timestamp() }}'
          expect:
            - statusCode: 200
      - think: 0.5

  - name: 'Read-heavy workload'
    weight: 50
    flow:
      - get:
          url: '/v1/loadtest/user:{{ $randomNumber(1, 10000) }}'
          expect:
            - statusCode: [200, 404]
      - think: 0.3

  - name: 'List operations'
    weight: 5
    flow:
      - get:
          url: '/v1/loadtest?prefix=user:'
          expect:
            - statusCode: 200
            - contentType: json
      - think: 1

  - name: 'Delete operations'
    weight: 5
    flow:
      - delete:
          url: '/v1/loadtest/user:{{ $randomNumber(1, 10000) }}'
          expect:
            - statusCode: [200, 404]
      - think: 0.5

  - name: 'Rate limit test'
    weight: 0
    flow:
      - loop:
          - get:
              url: '/v1/loadtest/rate-test'
          count: 150